Revit 2024 API
PhotometricWebLightDistribution.PhotometricWebFile Property
 The filename of an IES photometric web file.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string PhotometricWebFile { get; set; }
Visual Basic
Public Property PhotometricWebFile As String
	Get
	Set
Visual C++
public:
property String^ PhotometricWebFile {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace